In [2]:
import pandas as pd
import numpy as np

In [4]:
dict1 = {"Names":['Aravind', 'Samar', np.nan, 'Siri'],
        "Age":[np.nan, 21, 32, 43],
        "City":['Hyd', "Blr", "Chennai", np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [7]:
d1 = pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [9]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [13]:
dict2 = {"Names":['Aravind', 'Samar', None, 'Siri'],
        "Age":[np.nan, 21, 32, 43],
        "City":['Hyd', "Blr", "Chennai", None]}
d2  = pd.DataFrame(dict2)
d2

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [17]:
d2.dtypes

Names     object
Age      float64
City      object
dtype: object

In [14]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [16]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

**Percentage of Data missing in each column**

In [19]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan means not a number this is applicable for numerical columns only

- Generally data  has some empty rows 
- It is  a data problem
- If you read that kind of data you will see Null
- You need to understand, if data is corrupted or really Null values is there

**Method - 1**

**Fill with some random values**

**Method Name:** fill na

In [21]:
d1.fillna(40)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  Chennai
3     Siri  43.0       40

**Method - 2**

- We can fill the values with respect to columns also

In [23]:
d1['Age'].fillna(40) 

# will not update in origial data frame
# as inplace = False

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [24]:
d1['Age'].fillna(40, inplace=True)
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [30]:
dict1 = {"Names":['Aravind', 'Samar', np.nan, 'Siri'],
        "Age":[np.nan, 21, 32, 43],
        "City":['Hyd', "Blr", "Chennai", np.nan]}
d1 = pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [31]:
d1['Names'].fillna("Bibek", inplace=True)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Bibek  32.0  Chennai
3     Siri  43.0      NaN

In [32]:
dict1 = {"Names":['Aravind', 'Samar', np.nan, 'Siri'],
        "Age":[np.nan, 21, 32, 43],
        "City":['Hyd', "Blr", "Chennai", np.nan]}
d1 = pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

**Method-3**

- bfill
- ffill
- pad
- backfill

In [34]:
d1.fillna(method='bfill')
# Column1 : Name index 2 is missing value it  is filled with index 3 value
# Column2 : Age index 0 missing value is filled with index 1 value
# Column 3 : City  has index 3 as missing value but we dont have next value hence NAN
# It will fill with below or next value

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [35]:
dict1 = {"Names":['Aravind', 'Samar', np.nan, 'Siri'],
        "Age":[np.nan, 21, 32, 43],
        "City":['Hyd', "Blr", "Chennai", np.nan]}
d1 = pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [37]:
d1.fillna(method='ffill')
# Column1 : Name index 2 is missing value it  is filled with index 1 value
# Column2 : Age index 0 missing value is filled with previous value but there is no previous value hence NAN
# Column 3 : City  has index 3 as missing value it is filled with index 2 value
# It will fill with above or previous value

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [41]:
dict1 = {"Names":['Aravind', 'Samar', np.nan, 'Siri'],
        "Age":[np.nan, 21, 32, 43],
        "City":['Hyd', "Blr", "Chennai", np.nan]}
d1 = pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [45]:
d1.fillna(method='bfill', axis=1)
# axis = 1 means columns
# so NAN values will fill value from next column

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0      NaN

In [46]:
dict1 = {"Names":['Aravind', 'Samar', np.nan, 'Siri'],
        "Age":[np.nan, 21, 32, 43],
        "City":['Hyd', "Blr", "Chennai", np.nan]}
d1 = pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [47]:
d1.fillna(method='ffill', axis=1)
# axis = 1 will fill value from previous column

     Names      Age     City
0  Aravind  Aravind      Hyd
1    Samar     21.0      Blr
2      NaN     32.0  Chennai
3     Siri     43.0     43.0

In [48]:
dict1 = {"Names":['Aravind', 'Samar', np.nan, 'Siri'],
        "Age":[np.nan, 21, 32, 43],
        "City":['Hyd', "Blr", "Chennai", np.nan]}
d1 = pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [49]:
d1.fillna(method='pad')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

- backfill and bfill fill with next value
- pad and ffill fill with previous value 
- but it changes based on axis argument value

**Method-4**


- mean
    - Numerical values can fill with mean value
    - but mean is affected by outliers
    - if we dont have outliers it is best option
    
- median
    - Numerical values can be filled with median value
    - we know median is not affected by outliers
    - so if outliers are there we can go with median
    
- mode
    - mode is useful for categorical data

In [51]:
dict1 = {"Names":['Aravind', 'Samar', np.nan, 'Siri'],
        "Age":[np.nan, 21, 32, 43],
        "City":['Hyd', "Blr", "Chennai", np.nan]}
d1 = pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [52]:
# We already know we can fill with some values based on specific column using fillna
#d1.fillna(<random_number>)
#d1 represents all the columns
#age_mean = d1['Age'].mean()
# d1['Age'].fillna(age_mean)

In [53]:
age_mean = d1['Age'].mean()
d1.fillna(age_mean)

     Names   Age     City
0  Aravind  32.0      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0     32.0

In [54]:
age_median = d1['Age'].median()
d1.fillna(age_median)

     Names   Age     City
0  Aravind  32.0      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0     32.0

In [59]:
d1['City'].mode()
# In this use case we are getting model equal 
# But in real time we will get clear mode value

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

- Fill with random value
- Fill with random value on specific column
- fill with methods
    - bfill
    - ffill
    - pad
    - backfill
- fill with 
    - Mean
    - Median
    - Mode

**Method-5**

**KNN imputer**

- KNN: K Nearest Neighbours
- K is a hyper parameter means user can choose
- It is a distance metric: **Eucledian distance**
- KNN imputer will take mean of the neighbour values
- the neighbour value can be provided by using value = k
- It is under sklearn package
- Under sklearn we have Imputer method
- Under Imputer method we have KNNImputer
- Applicable only for numerical data

<img src="https://vitalflux.com/wp-content/uploads/2020/12/Euclidean-Distance-formula-2.png" jsaction="VQAsE" class="sFlh5c pT0Scc iPVvYb" style="max-width: 651px; height: 381px; margin: 0px; width: 466px;" alt="Different Types of Distance Measures in Machine Learning - Analytics Yogi" jsname="kn3ccd" aria-hidden="false">

<img src="https://miro.medium.com/v2/resize:fit:887/1*ZZ9RQsBRyoLQABsGTKviDg.png" jsaction="VQAsE" class="sFlh5c pT0Scc iPVvYb" style="max-width: 887px; width: 557px; height: 316px; margin: 0.5px 0px;" alt="Understand Euclidean Distance. There are a lot of metrics but today… | by  Ahmad Mizan Nur Haq | DevOps.dev" jsname="kn3ccd" aria-hidden="false">

In [62]:
from sklearn.impute import KNNImputer
knn = KNNImputer()
knn.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])